from ._stage_data import stage

card_info = [
    [1,1,1,0,0], [2,1,2,0,1], [3,1,3,0,2], [4,1,4,0,3], [5,1,4,0,3],
    [6,1,5,0,4], [7,1,5,0,4], [8,1,6,0,5], [9,1,6,0,5], [10,1,7,0,6],
    [11,1,7,0,6], [12,1,8,0,7], [13,1,8,0,7], [14,1,9,0,8], [15,1,9,0,8],
    [16,1,10,0,9], [17,1,10,0,9], [18,1,11,0,10], [19,1,12,0,11],
    [20,1,-1,0,20], [21,1,-2,0,21], [22,1,-3,0,22],
    [23,2,2,0,40], [24,2,3,0,41], [25,2,5,0,43],
    [26,2,7,0,45], [27,2,8,0,46], [28,2,10,0,48],
    [29,3,1,0,69], [30,3,1,0,69]
]

user_card_info = [
    [1,'앞으로 1칸 이동',1,1,'N'], [2,'앞으로 2칸 이동',1,2,'N'],
    [3,'앞으로 3칸 이동',1,3,'N'], [4,'앞으로 4칸 이동',1,4,'N'],
    [5,'앞으로 4칸 이동',1,4,'N'], [6,'앞으로 5칸 이동',1,5,'N'],
    [7,'앞으로 5칸 이동',1,5,'N'], [8,'앞으로 6칸 이동',1,6,'N'],
    [9,'앞으로 6칸 이동',1,6,'N'], [10,'앞으로 7칸 이동',1,7,'N'],
    [11,'앞으로 7칸 이동',1,7,'N'], [12,'앞으로 8칸 이동',1,8,'N'],
    [13,'앞으로 8칸 이동',1,8,'N'], [14,'앞으로 9칸 이동',1,9,'N'],
    [15,'앞으로 9칸 이동',1,9,'N'], [16,'앞으로 10칸 이동',1,10,'N'],
    [17,'앞으로 10칸 이동',1,10,'N'], [18,'앞으로 11칸 이동',1,11,'N'],
    [19,'앞으로 12칸 이동',1,12,'N'], [20,'뒤로 1칸 이동',1,-1,'N'],
    [21,'뒤로 2칸 이동',1,-2,'N'], [22,'뒤로 3칸 이동',1,-3,'N'],
    [23,'주사위 2배!',2,2,'N'], [24,'주사위 3배!!',2,3,'N'],
    [25,'주사위 5배!!!',2,5,'N'], [26,'주사위 7배!!!!',2,7,'N'],
    [27,'주사위 8배!!!!!',2,8,'N'], [28,'주사위 10배!!!!!!',2,10,'N'],
    [29,'다음 스테이지 첫번째 칸으로 이동!',3,1,'N'],
    [30,'다음 스테이지 첫번째 칸으로 이동!',3,1,'N']
]

stage_names = [
    "벨로스","산림지대","고목나무 숲","플루톤 신전","엘리아스","들판지대","지하동굴","산악지대",
    "용경","붉은수수밭","아르카디아","벚나무 호숫가","아오이치","흑월성","사막지대","피라미드",
    "엘파","어둠의 숲","포우 저택","오르카 해변","정글지대","크투가 유적","베히모스의 뱃속",
    "위로위로 나무","크투가 유적 지하","심연의 유적","아쿠아리움","지하수로","비프로스트","행거",
    "수경농장","디-라보","길드연합","엘 아노르 평원(남부)","엘 아노르 평원(서부)","엘 아노르 평원(동부)",
    "엘 아노르 산악지대","별가루 평원","통곡의 해안","붕괴의 탑","바나헤임","세계수의 환영 입구",
    "벨파 도서관","잊혀진 평원","석양의 평원","무한회랑","산호의 숲","오로라의 숲","천공성",
    "비취수림","폭풍의 감시자 폐허","석영동굴","버섯의 숲","메린 섬","트레져 비치","아키시티",
    "세레스의 신전","쥬드 왕국 수도","화이트 콜 협곡","루맨","수련의 숲","불타는 도시",
    "아말룬 사막","타르타로스","지하도시 공사장","아드리카","포보스","데보라 설원","아발론",
    "수정달 숲","라란가도","우주여행","우주여행","우주여행","우주여행"
]
